#+options: tex:verbatim
#+TITLE: Results on mnist dataset

* General
#+NAME: init_block
#+BEGIN_SRC python
  import numpy as np
  import pandas as pd
  from pathlib import Path
  import re

  from lib.parse_logs import parse_test_optimizer_log, org_group_and_summarize, org_table


  def get_unique_name(name):
      try:
          unique_name = re.findall(".+(?=_.+)", name)[0]
      except:
          unique_name = re.findall(".+(?=\d+)", name)[0]
      unique_name = unique_name[unique_name.find("_") + 1:]
      unique_name = unique_name[unique_name.find("_") + 1:]
      unique_name = unique_name[unique_name.find("_") + 1:]
      # unique_name = unique_name[unique_name.find("_") + 1:]
      return unique_name


  def parse_output_logs(paths, norm, type, allowed_thresholds=None):
      if not isinstance(paths, (list, tuple)):
          paths = list(paths)
      if allowed_thresholds is None:
          allowed_thresholds = []

      df_sublist = []
      for p in paths:
          p = Path(p)
          df = parse_test_optimizer_log(p / f"test_{norm}_{type}",
                                        exclude=['nll_loss', 'conf'])
          df_sublist.append(df)
      df = pd.concat(df_sublist, ignore_index=True)
      if len(allowed_thresholds) > 0:
          for col in df.columns:
              if col.startswith(f"acc_{norm}_"):
                  if col not in [
                          f"acc_{norm}_{th:.2f}" for th in allowed_thresholds
                  ]:
                      df = df.drop(columns=[col])
      df = df.sort_values(norm, ascending=True)
      return df


  def output_org_results(logs, norm, summarize=False, topk=100):
      if summarize:
          logs = pd.concat(logs, ignore_index=True)
          logs_org = org_group_and_summarize(logs,
                                             group_by=get_unique_name,
                                             sort_groups=True,
                                             sort_keys=norm)
      else:
          logs_org = []
          first = True
          for log in logs:
              if first:
                  if topk is not None:
                      logs_org.extend(org_table(log)[:3 + topk] + [None])
                  else:
                      logs_org.extend(org_table(log))
                      first = False
              else:
                  if topk is not None:
                      logs_org.extend(org_table(log)[3:topk + 3] + [None])
                  else:
                      logs_org.extend(org_table(log)[3:])
      return logs_org
#+END_SRC

#+RESULTS: init_block
: None

#+NAME: output_results
#+BEGIN_SRC python :noweb yes
  df = parse_output_logs(["./results/mnist"], norm, type, allowed_thresholds=thresholds)
  df = df[getattr(df, f"acc_{norm}") == 0]
  df = df[df.name.str.contains("_0k")]
  # df = df[df.name.str.contains("_gnorm")]
  # df = df[df.name.str.contains("_decay")]
  df_org = output_org_results([df], norm, summarize=False, topk=30)
#+END_SRC

#+RESULTS: output_results

* L0
** Plain
#+BEGIN_SRC python :noweb yes :var norm="l0" :var type="plain" :results value :return df_org
  <<init_block>>
  thresholds = [10.0, 30.0, 50.0, 80.0, 100.0]
  <<output_results>>
#+END_SRC

#+RESULTS:
|----------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+--------+-----------|
| name                                                                                               |   acc | acc_l0 |  conf_l0 | acc_l0_10.00 | acc_l0_30.00 | acc_l0_50.00 | acc_l0_80.00 | acc_l0_100.00 |     l0 |   l0_corr |
|----------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+--------+-----------|
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0       | 0.987 |    0.0 | 0.682442 |        0.375 |        0.001 |          0.0 |          0.0 |           0.0 |  9.606 |  9.732523 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.695144 |         0.39 |        0.001 |          0.0 |          0.0 |           0.0 |  9.659 |  9.786221 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.690087 |        0.382 |        0.002 |          0.0 |          0.0 |           0.0 |  9.665 |    9.7923 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0     | 0.987 |    0.0 | 0.689534 |        0.387 |        0.001 |          0.0 |          0.0 |           0.0 |  9.688 |  9.815603 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.671627 |        0.377 |        0.001 |          0.0 |          0.0 |           0.0 |    9.7 |  9.827761 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 |  0.69687 |        0.385 |        0.002 |          0.0 |          0.0 |           0.0 |  9.711 |  9.838905 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.701217 |        0.397 |        0.001 |          0.0 |          0.0 |           0.0 |  9.731 |  9.859169 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.669245 |        0.397 |        0.002 |          0.0 |          0.0 |           0.0 |  9.767 |  9.895643 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.987 |    0.0 | 0.681522 |        0.382 |        0.004 |          0.0 |          0.0 |           0.0 |  9.771 |  9.899696 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.683798 |        0.384 |        0.004 |          0.0 |          0.0 |           0.0 |  9.796 |  9.925025 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.987 |    0.0 | 0.711753 |        0.412 |        0.001 |          0.0 |          0.0 |           0.0 |   9.84 |  9.969604 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.987 |    0.0 | 0.689297 |        0.389 |        0.004 |          0.0 |          0.0 |           0.0 |  9.856 |  9.985816 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.694311 |        0.388 |        0.001 |          0.0 |          0.0 |           0.0 |  9.878 | 10.008105 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.987 |    0.0 | 0.709833 |        0.423 |          0.0 |          0.0 |          0.0 |           0.0 |  9.916 | 10.046606 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.987 |    0.0 | 0.693694 |        0.399 |        0.003 |          0.0 |          0.0 |           0.0 |  9.943 | 10.073961 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.05_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.696645 |        0.391 |        0.004 |          0.0 |          0.0 |           0.0 |  9.945 | 10.075988 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0       | 0.987 |    0.0 |  0.65119 |        0.393 |        0.005 |          0.0 |          0.0 |           0.0 |  9.959 | 10.090172 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0     | 0.987 |    0.0 | 0.653312 |        0.393 |        0.005 |          0.0 |          0.0 |           0.0 |  9.991 | 10.122594 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.725896 |        0.427 |        0.001 |          0.0 |          0.0 |           0.0 | 10.054 | 10.186423 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.724029 |        0.431 |          0.0 |          0.0 |          0.0 |           0.0 | 10.102 | 10.235056 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.639122 |        0.414 |        0.006 |          0.0 |          0.0 |           0.0 | 10.162 | 10.295846 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.721157 |        0.438 |          0.0 |          0.0 |          0.0 |           0.0 | 10.237 | 10.371834 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0       | 0.987 |    0.0 | 0.709692 |        0.427 |        0.007 |        0.001 |          0.0 |           0.0 | 10.254 | 10.389058 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.644887 |        0.418 |        0.006 |        0.001 |          0.0 |           0.0 | 10.278 | 10.413374 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.723679 |        0.444 |          0.0 |          0.0 |          0.0 |           0.0 | 10.285 | 10.420466 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.724637 |        0.439 |        0.002 |          0.0 |          0.0 |           0.0 | 10.293 | 10.428572 |
| mnist_l0_plain_100_0k_adam_cw_nognorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 |  0.69906 |        0.407 |        0.004 |        0.002 |          0.0 |           0.0 | 10.296 | 10.431611 |
| mnist_l0_plain_100_0k_adam_cw_nognorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.987 |    0.0 | 0.689223 |        0.401 |        0.013 |          0.0 |          0.0 |           0.0 | 10.408 | 10.545086 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0      | 0.987 |    0.0 | 0.703282 |        0.412 |         0.01 |        0.004 |          0.0 |           0.0 | 10.408 | 10.545086 |
| mnist_l0_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_proxy_0     | 0.987 |    0.0 |   0.7222 |        0.441 |        0.007 |        0.001 |          0.0 |           0.0 | 10.424 | 10.561296 |
|----------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+--------+-----------|

** Linf
#+BEGIN_SRC python :noweb yes :var norm="l0" :var type="linf" :results value :return df_org
  <<init_block>>
  thresholds = [10.0, 30.0, 50.0, 80.0, 100.0]
  <<output_results>>
#+END_SRC

#+RESULTS:
|-------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+-------+----------|
| name                                                                                            |   acc | acc_l0 |  conf_l0 | acc_l0_10.00 | acc_l0_30.00 | acc_l0_50.00 | acc_l0_80.00 | acc_l0_100.00 |    l0 |  l0_corr |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+-------+----------|
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.15_llr0.05_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.985 |    0.0 |  0.53527 |        0.201 |        0.002 |          0.0 |          0.0 |           0.0 | 7.683 |      7.8 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.15_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.536108 |        0.202 |        0.002 |          0.0 |          0.0 |           0.0 | 7.694 | 7.811168 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.2_llr0.05_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.544356 |        0.213 |        0.001 |          0.0 |          0.0 |           0.0 | 7.758 | 7.876142 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.2_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.544129 |        0.213 |        0.001 |          0.0 |          0.0 |           0.0 | 7.759 | 7.877157 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.25_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 |  0.56216 |         0.22 |        0.002 |          0.0 |          0.0 |           0.0 | 7.861 | 7.980711 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.25_llr0.05_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.985 |    0.0 | 0.560309 |        0.219 |        0.002 |          0.0 |          0.0 |           0.0 | 7.864 | 7.983757 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.526943 |        0.217 |        0.004 |          0.0 |          0.0 |           0.0 |  7.91 | 8.030457 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.05_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 |  0.55074 |        0.227 |        0.003 |          0.0 |          0.0 |           0.0 | 7.941 | 8.061929 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.05_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.526974 |        0.222 |        0.005 |          0.0 |          0.0 |           0.0 | 7.942 | 8.062944 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.550917 |        0.227 |        0.003 |          0.0 |          0.0 |           0.0 |  7.95 | 8.071066 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.05_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.512591 |        0.222 |        0.009 |          0.0 |          0.0 |           0.0 | 8.018 | 8.140101 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.985 |    0.0 | 0.535424 |        0.231 |        0.005 |          0.0 |          0.0 |           0.0 | 8.046 | 8.168528 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.985 |    0.0 | 0.535091 |        0.231 |        0.005 |          0.0 |          0.0 |           0.0 | 8.046 | 8.168528 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.05_llr0.05_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.985 |    0.0 | 0.512694 |        0.223 |         0.01 |          0.0 |          0.0 |           0.0 | 8.047 | 8.169543 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.3_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.577739 |        0.247 |        0.004 |          0.0 |          0.0 |           0.0 | 8.205 | 8.329949 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.3_llr0.05_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.577815 |        0.247 |        0.004 |          0.0 |          0.0 |           0.0 | 8.206 | 8.330964 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.25_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.569502 |        0.253 |        0.004 |          0.0 |          0.0 |           0.0 | 8.324 | 8.450762 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.25_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 |  0.56957 |        0.254 |        0.004 |          0.0 |          0.0 |           0.0 | 8.327 | 8.453807 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.2_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.553485 |        0.255 |        0.006 |          0.0 |          0.0 |           0.0 | 8.346 | 8.473097 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.2_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.985 |    0.0 | 0.553243 |        0.255 |        0.006 |          0.0 |          0.0 |           0.0 | 8.349 | 8.476142 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.985 |    0.0 | 0.549629 |        0.245 |        0.005 |          0.0 |          0.0 |           0.0 | 8.408 |  8.53604 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.549654 |        0.245 |        0.005 |          0.0 |          0.0 |           0.0 | 8.409 | 8.537056 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.15_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.542751 |        0.258 |        0.009 |          0.0 |          0.0 |           0.0 |  8.53 | 8.659899 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.15_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 |  0.54277 |        0.258 |        0.009 |          0.0 |          0.0 |           0.0 | 8.532 | 8.661929 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.35_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.609273 |        0.277 |        0.004 |        0.001 |          0.0 |           0.0 | 8.621 | 8.752284 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.35_llr0.05_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.985 |    0.0 | 0.609403 |        0.277 |        0.004 |        0.001 |          0.0 |           0.0 |  8.63 | 8.761421 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.3_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.985 |    0.0 | 0.587504 |        0.278 |        0.004 |          0.0 |          0.0 |           0.0 | 8.662 | 8.793909 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.3_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.587626 |        0.284 |        0.005 |          0.0 |          0.0 |           0.0 | 8.699 | 8.831472 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0      | 0.985 |    0.0 | 0.564245 |        0.285 |        0.005 |          0.0 |          0.0 |           0.0 | 8.789 | 8.922843 |
| mnist_l0_linf_100_0k_apg_cw_gnorm_lr0.35_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.610208 |         0.27 |        0.007 |          0.0 |          0.0 |           0.0 | 8.797 | 8.930964 |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+-------+----------|

** L2
#+BEGIN_SRC python :noweb yes :var norm="l0" :var type="l2" :results value :return df_org
  <<init_block>>
  thresholds = [10.0, 30.0, 50.0, 80.0, 100.0]
  <<output_results>>
#+END_SRC

#+RESULTS:
|-------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+-----------+-----------|
| name                                                                                            |   acc | acc_l0 |  conf_l0 | acc_l0_10.00 | acc_l0_30.00 | acc_l0_50.00 | acc_l0_80.00 | acc_l0_100.00 |        l0 |   l0_corr |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+-----------+-----------|
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.987 |    0.0 | 0.510274 |        0.823 |        0.156 |        0.017 |        0.001 |           0.0 | 20.516001 | 20.786221 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.511111 |        0.823 |        0.157 |        0.017 |        0.001 |         0.001 | 20.533001 | 20.803444 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.510372 |        0.829 |        0.159 |        0.019 |        0.001 |         0.001 |    20.805 | 21.079027 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.510656 |        0.831 |        0.161 |        0.016 |        0.001 |         0.001 | 20.846001 | 21.120567 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.510088 |        0.824 |        0.168 |        0.032 |        0.004 |         0.002 |    20.972 | 21.248226 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.509474 |        0.823 |        0.165 |         0.03 |        0.004 |         0.002 | 20.976999 | 21.253292 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.987 |    0.0 | 0.511426 |        0.839 |        0.168 |        0.018 |        0.001 |           0.0 | 21.169001 | 21.447823 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.510658 |        0.838 |        0.171 |        0.022 |          0.0 |           0.0 | 21.214001 | 21.493414 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.987 |    0.0 | 0.509185 |        0.832 |        0.175 |        0.032 |        0.004 |         0.001 | 21.259001 | 21.539007 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.508857 |        0.832 |        0.178 |        0.034 |        0.003 |           0.0 |    21.275 | 21.555218 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.511179 |        0.847 |        0.179 |        0.025 |        0.001 |           0.0 | 21.639999 | 21.925026 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.511225 |        0.848 |        0.181 |        0.026 |          0.0 |           0.0 | 21.686001 | 21.971632 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.511686 |        0.839 |        0.184 |        0.042 |        0.005 |         0.002 |    21.955 | 22.244175 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.511586 |        0.839 |        0.188 |        0.041 |        0.006 |         0.003 |    21.958 | 22.247213 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.987 |    0.0 | 0.512312 |        0.851 |        0.204 |        0.045 |        0.005 |         0.003 | 22.617001 | 22.914894 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.512193 |        0.851 |          0.2 |        0.047 |        0.006 |         0.002 |    22.638 | 22.936171 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.512856 |        0.881 |        0.226 |        0.047 |        0.006 |         0.003 |     23.91 | 24.224924 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.512856 |        0.881 |        0.226 |        0.047 |        0.006 |         0.003 |     23.91 | 24.224924 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.504924 |        0.916 |        0.361 |        0.023 |        0.001 |           0.0 |    26.795 | 27.147923 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.506584 |        0.919 |        0.373 |        0.024 |        0.001 |           0.0 | 26.969999 | 27.325228 |
| mnist_l0_l2_100_0k_apg_cw_gnorm_lr0.15_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0      | 0.987 |    0.0 | 0.523439 |        0.882 |        0.369 |        0.098 |        0.011 |         0.001 | 28.033001 | 28.402229 |
| mnist_l0_l2_100_0k_apg_cw_gnorm_lr0.15_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.523213 |        0.881 |        0.365 |          0.1 |        0.011 |         0.001 |    28.114 | 28.484297 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.987 |    0.0 | 0.511587 |        0.919 |         0.39 |        0.064 |        0.005 |         0.002 |    28.431 | 28.805471 |
| mnist_l0_l2_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.511587 |        0.919 |         0.39 |        0.064 |        0.005 |         0.002 |    28.431 | 28.805471 |
| mnist_l0_l2_100_0k_apg_cw_gnorm_lr0.2_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0       | 0.987 |    0.0 | 0.544717 |        0.881 |        0.372 |         0.11 |         0.01 |           0.0 |    28.546 | 28.921986 |
| mnist_l0_l2_100_0k_apg_cw_gnorm_lr0.2_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0     | 0.987 |    0.0 | 0.545299 |        0.882 |        0.375 |        0.109 |        0.012 |           0.0 | 28.552999 | 28.929077 |
| mnist_l0_l2_100_0k_apg_cw_gnorm_lr0.25_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.556435 |        0.884 |        0.417 |        0.124 |        0.008 |         0.001 |    29.343 | 29.729483 |
| mnist_l0_l2_100_0k_apg_cw_gnorm_lr0.25_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0      | 0.987 |    0.0 | 0.557086 |        0.885 |        0.418 |        0.128 |        0.007 |         0.001 |    29.409 | 29.796352 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.1_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.542276 |        0.909 |        0.396 |        0.115 |         0.01 |         0.004 |    29.414 | 29.801418 |
| mnist_l0_l2_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.987 |    0.0 | 0.543891 |         0.91 |        0.391 |        0.117 |        0.012 |         0.004 |    29.513 | 29.901722 |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+--------------+--------------+--------------+--------------+---------------+-----------+-----------|

* L1
** Plain
#+BEGIN_SRC python :noweb yes :var norm="l1" :var type="plain" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(2, 10, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| name                                                                                          |   acc | acc_l1 |  conf_l1 | acc_l1_2.00 | acc_l1_4.00 | acc_l1_6.00 | acc_l1_8.00 | acc_l1_10.00 |       l1 |  l1_corr |
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0    | 0.987 |    0.0 | 0.558709 |       0.945 |       0.809 |       0.546 |       0.314 |        0.151 | 6.687219 | 6.775298 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0    | 0.987 |    0.0 | 0.558615 |       0.945 |       0.802 |       0.537 |       0.314 |        0.161 | 6.705115 | 6.793429 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.546739 |       0.944 |       0.807 |       0.545 |        0.32 |         0.16 | 6.722152 | 6.810691 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.570462 |       0.946 |       0.806 |       0.552 |       0.319 |        0.155 | 6.726489 | 6.815085 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0    | 0.987 |    0.0 | 0.539201 |       0.945 |       0.802 |       0.548 |       0.323 |        0.159 | 6.734281 | 6.822979 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.549342 |       0.943 |       0.803 |       0.539 |       0.311 |        0.167 |  6.75176 | 6.840688 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.569119 |       0.944 |       0.806 |       0.547 |       0.321 |        0.156 | 6.767752 | 6.856892 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.573628 |       0.944 |       0.812 |       0.552 |       0.318 |        0.154 | 6.776522 | 6.865777 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0  | 0.987 |    0.0 |  0.54112 |       0.944 |       0.806 |       0.554 |       0.333 |        0.164 | 6.781754 | 6.871078 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0    | 0.987 |    0.0 | 0.577301 |       0.944 |       0.808 |       0.548 |       0.322 |        0.152 | 6.783691 | 6.873041 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0 | 0.987 |    0.0 | 0.554276 |       0.943 |       0.809 |       0.551 |       0.329 |        0.158 | 6.785925 | 6.875304 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.596498 |       0.945 |        0.81 |       0.552 |       0.325 |        0.156 | 6.789526 | 6.878953 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0    | 0.987 |    0.0 | 0.539399 |       0.943 |         0.8 |        0.55 |       0.318 |        0.162 | 6.793963 | 6.883448 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0   | 0.987 |    0.0 | 0.530827 |       0.943 |       0.809 |       0.556 |       0.331 |        0.165 | 6.796435 | 6.885952 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0  | 0.987 |    0.0 | 0.560943 |       0.942 |        0.81 |        0.55 |       0.324 |        0.155 | 6.796926 | 6.886449 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0  | 0.987 |    0.0 | 0.551923 |       0.942 |       0.798 |        0.55 |       0.318 |         0.17 | 6.798289 | 6.887831 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0 | 0.987 |    0.0 | 0.547083 |       0.942 |         0.8 |       0.548 |       0.327 |        0.169 | 6.804361 | 6.893982 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.25_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0  | 0.987 |    0.0 | 0.562635 |       0.944 |       0.809 |       0.558 |        0.33 |        0.167 | 6.805174 | 6.894806 |
| mnist_l1_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_proxy_0   | 0.987 |    0.0 |  0.52329 |       0.944 |       0.803 |       0.545 |       0.316 |        0.158 | 6.805224 | 6.894857 |
| mnist_l1_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_proxy_0  | 0.987 |    0.0 | 0.519811 |       0.941 |       0.802 |       0.553 |       0.322 |        0.157 | 6.807733 | 6.897399 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0 | 0.987 |    0.0 | 0.566344 |       0.944 |       0.805 |       0.545 |       0.325 |        0.158 | 6.814459 | 6.904214 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0  | 0.987 |    0.0 |  0.58787 |       0.945 |       0.813 |       0.558 |       0.327 |        0.167 | 6.817916 | 6.907716 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0 | 0.987 |    0.0 | 0.573891 |       0.944 |       0.804 |        0.55 |       0.329 |        0.158 | 6.820615 |  6.91045 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0  | 0.987 |    0.0 | 0.522826 |       0.943 |       0.799 |       0.545 |       0.329 |        0.165 | 6.821084 | 6.910926 |
| mnist_l1_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.1_uniform_R0.5_decay_finetune_proxy_0     | 0.987 |    0.0 | 0.513246 |       0.942 |       0.801 |       0.545 |       0.325 |        0.162 | 6.823376 | 6.913248 |
| mnist_l1_plain_100_0k_apg_cw_gnorm_lr0.4_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_proxy_0   | 0.987 |    0.0 | 0.518323 |       0.942 |       0.801 |       0.548 |       0.317 |         0.16 | 6.823978 | 6.913859 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0    | 0.987 |    0.0 | 0.574105 |       0.944 |       0.807 |       0.555 |       0.317 |        0.159 | 6.825934 | 6.915841 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0  | 0.987 |    0.0 | 0.600649 |       0.946 |       0.812 |       0.555 |       0.337 |        0.159 | 6.828066 | 6.918001 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0 | 0.987 |    0.0 | 0.530955 |       0.943 |       0.809 |       0.558 |       0.331 |        0.168 | 6.829025 | 6.918972 |
| mnist_l1_plain_100_0k_apg_cw_nognorm_lr0.3_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0 | 0.987 |    0.0 | 0.558577 |       0.944 |       0.812 |       0.562 |       0.334 |         0.17 | 6.830151 | 6.920112 |
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|

** Linf
#+BEGIN_SRC python :noweb yes :var norm="l1" :var type="linf" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(2.5, 12.5, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| name                                                                                            |   acc | acc_l1 |  conf_l1 | acc_l1_2.50 | acc_l1_5.00 | acc_l1_7.50 | acc_l1_10.00 | acc_l1_12.50 |       l1 |  l1_corr |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.498716 |       0.682 |       0.251 |       0.074 |        0.021 |        0.006 | 3.823672 | 3.881901 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0      | 0.985 |    0.0 |  0.49818 |       0.684 |       0.256 |       0.079 |        0.022 |        0.007 | 3.829033 | 3.887343 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0    | 0.985 |    0.0 | 0.504151 |       0.692 |       0.259 |       0.073 |        0.021 |        0.006 | 3.842931 | 3.901453 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.5_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_proxy_0     | 0.985 |    0.0 |  0.49795 |       0.676 |       0.262 |       0.072 |        0.023 |        0.008 |   3.8465 | 3.905076 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.985 |    0.0 | 0.508967 |       0.704 |        0.25 |       0.071 |        0.016 |        0.001 | 3.848615 | 3.907223 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0      | 0.985 |    0.0 | 0.508976 |       0.705 |       0.258 |       0.077 |        0.015 |        0.001 | 3.854626 | 3.913325 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.5_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.500316 |       0.682 |       0.261 |       0.075 |        0.025 |        0.008 | 3.859663 | 3.918439 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0     | 0.985 |    0.0 | 0.496511 |       0.683 |       0.258 |       0.079 |        0.024 |        0.008 | 3.864301 | 3.923148 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.497654 |       0.685 |       0.263 |       0.078 |        0.023 |        0.007 | 3.865067 | 3.923926 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.985 |    0.0 | 0.497321 |       0.707 |        0.26 |       0.076 |        0.021 |        0.006 | 3.865554 | 3.924421 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.985 |    0.0 | 0.504356 |       0.696 |       0.267 |       0.071 |        0.017 |        0.003 | 3.866721 | 3.925605 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0   | 0.985 |    0.0 | 0.500361 |       0.696 |       0.274 |       0.073 |        0.016 |        0.003 | 3.869584 | 3.928511 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0   | 0.985 |    0.0 | 0.510923 |       0.712 |       0.256 |       0.075 |        0.016 |        0.002 | 3.874253 | 3.933252 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0     | 0.985 |    0.0 | 0.500759 |       0.696 |       0.269 |       0.078 |        0.018 |        0.005 | 3.874879 | 3.933887 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_proxy_0    | 0.985 |    0.0 | 0.496472 |       0.674 |       0.268 |       0.077 |        0.024 |        0.007 | 3.891563 | 3.950825 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.985 |    0.0 | 0.496239 |       0.708 |       0.273 |        0.08 |        0.023 |        0.005 | 3.892273 | 3.951546 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0   | 0.985 |    0.0 | 0.496542 |       0.686 |       0.277 |       0.092 |        0.018 |        0.008 |  3.89647 | 3.955807 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0 | 0.985 |    0.0 | 0.508143 |       0.709 |        0.26 |       0.087 |        0.017 |        0.002 | 3.903436 | 3.962879 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_proxy_0    | 0.985 |    0.0 | 0.513607 |       0.712 |       0.261 |       0.078 |         0.02 |        0.002 | 3.906188 | 3.965674 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.985 |    0.0 | 0.503659 |       0.707 |       0.266 |       0.081 |        0.023 |        0.007 | 3.906378 | 3.965866 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.516207 |       0.719 |       0.258 |       0.077 |        0.016 |        0.001 | 3.906424 | 3.965913 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.985 |    0.0 | 0.507782 |       0.701 |       0.276 |       0.079 |        0.017 |        0.003 | 3.911149 |  3.97071 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0     | 0.985 |    0.0 | 0.515136 |       0.712 |       0.274 |       0.071 |        0.015 |        0.003 | 3.913324 | 3.972918 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.503182 |       0.712 |       0.264 |       0.078 |        0.022 |        0.007 | 3.915049 | 3.974669 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0   | 0.985 |    0.0 | 0.509693 |       0.712 |       0.262 |       0.083 |         0.02 |        0.005 | 3.915263 | 3.974886 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.4_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.495356 |       0.687 |       0.277 |       0.084 |        0.022 |        0.007 | 3.915463 | 3.975089 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0    | 0.985 |    0.0 | 0.502821 |       0.707 |       0.264 |       0.075 |        0.022 |        0.007 | 3.920944 | 3.980654 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.4_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0      | 0.985 |    0.0 | 0.495885 |        0.69 |       0.269 |       0.083 |        0.022 |        0.007 | 3.921124 | 3.980836 |
| mnist_l1_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.985 |    0.0 |  0.49787 |       0.685 |        0.28 |       0.083 |        0.023 |        0.008 | 3.921663 | 3.981383 |
| mnist_l1_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0   | 0.985 |    0.0 | 0.506941 |       0.716 |        0.27 |       0.075 |        0.012 |        0.002 | 3.922598 | 3.982333 |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|

** L2
#+BEGIN_SRC python :noweb yes :var norm="l1" :var type="l2" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(5, 20, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+--------------+--------------+--------------+-----------+-----------|
| name                                                                                          |   acc | acc_l1 |  conf_l1 | acc_l1_5.00 | acc_l1_8.75 | acc_l1_12.50 | acc_l1_16.25 | acc_l1_20.00 |        l1 |   l1_corr |
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+--------------+--------------+--------------+-----------+-----------|
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.495659 |       0.907 |       0.743 |         0.53 |        0.262 |        0.116 | 12.823787 | 12.992692 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.495991 |        0.91 |       0.752 |        0.529 |        0.262 |        0.108 | 12.835037 | 13.004089 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.495303 |        0.91 |       0.747 |        0.519 |        0.266 |        0.113 | 12.836147 | 13.005217 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.494413 |       0.909 |       0.749 |        0.527 |        0.269 |        0.114 | 12.865637 | 13.035093 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.493004 |       0.907 |       0.747 |        0.529 |        0.268 |        0.117 | 12.866117 |  13.03558 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.491905 |       0.907 |       0.749 |        0.525 |        0.271 |        0.114 | 12.873598 | 13.043159 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.499092 |        0.91 |       0.752 |        0.537 |        0.271 |        0.109 | 12.888844 | 13.058605 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.497384 |       0.908 |       0.755 |        0.536 |        0.271 |        0.115 | 12.905866 | 13.075851 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 |  0.49107 |       0.908 |       0.749 |        0.528 |         0.27 |         0.12 | 12.910777 | 13.080828 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.495609 |        0.91 |       0.756 |        0.533 |        0.269 |        0.117 |   12.9236 | 13.093821 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.501614 |        0.91 |       0.754 |        0.528 |        0.273 |        0.117 | 12.925572 | 13.095818 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.25_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.495985 |       0.909 |       0.753 |        0.528 |        0.271 |        0.118 | 12.926242 | 13.096498 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.502539 |       0.908 |        0.75 |         0.54 |        0.265 |        0.122 | 12.931864 | 13.102193 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.497301 |       0.909 |        0.75 |        0.538 |         0.27 |         0.12 | 12.934483 | 13.104845 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0       | 0.987 |    0.0 | 0.496108 |       0.909 |       0.747 |        0.526 |        0.278 |        0.118 |  12.94112 |  13.11157 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.05_C0.1_uniform_R0.5_decay_finetune_proxy_0      | 0.987 |    0.0 | 0.496614 |       0.908 |       0.752 |        0.536 |         0.27 |        0.121 |  12.94414 | 13.114631 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.494533 |       0.909 |       0.755 |        0.535 |        0.281 |        0.118 | 12.948369 | 13.118915 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 |  0.49927 |        0.91 |        0.75 |        0.534 |        0.274 |        0.117 |  12.94962 | 13.120182 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0      | 0.987 |    0.0 | 0.494855 |       0.908 |       0.752 |        0.531 |         0.27 |        0.121 | 12.954279 | 13.124903 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.493569 |        0.91 |       0.749 |        0.535 |        0.275 |        0.116 | 12.954681 | 13.125309 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.505731 |        0.91 |       0.752 |        0.537 |        0.277 |        0.115 | 12.954869 | 13.125501 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.1_uniform_R0.5_decay_finetune_proxy_0     | 0.987 |    0.0 | 0.495324 |       0.908 |       0.756 |        0.543 |        0.275 |        0.124 | 12.975937 | 13.146846 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.25_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.492863 |       0.908 |       0.757 |        0.532 |        0.277 |        0.117 |  12.97708 | 13.148005 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.3_llr0.05_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.493754 |       0.911 |       0.755 |        0.534 |        0.273 |        0.122 | 12.983377 | 13.154385 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.502829 |       0.908 |       0.755 |        0.543 |        0.275 |        0.114 | 12.988126 | 13.159196 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0       | 0.987 |    0.0 | 0.494084 |        0.91 |       0.749 |        0.534 |        0.274 |        0.121 | 12.991865 | 13.162984 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.05_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.505121 |        0.91 |       0.756 |        0.544 |        0.272 |        0.119 | 12.998129 | 13.169331 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.500807 |       0.911 |       0.758 |        0.537 |        0.273 |        0.121 | 13.007194 | 13.178512 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.1_uniform_R0.5_decay_finetune_proxy_0      | 0.987 |    0.0 | 0.494066 |       0.907 |        0.75 |        0.535 |         0.28 |        0.128 | 13.011548 | 13.182926 |
| mnist_l1_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0      | 0.987 |    0.0 | 0.493031 |       0.911 |        0.75 |        0.538 |        0.279 |        0.126 | 13.017324 | 13.188778 |
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+--------------+--------------+--------------+-----------+-----------|

* L2
** Plain
#+BEGIN_SRC python :noweb yes :var norm="l2" :var type="plain" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(0.5, 2.5, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| name                                                                                           |   acc | acc_l2 |  conf_l2 | acc_l2_0.50 | acc_l2_1.00 | acc_l2_1.50 | acc_l2_2.00 | acc_l2_2.50 |       l2 |  l2_corr |
|------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0     | 0.984 |    0.0 | 0.537199 |       0.932 |       0.534 |       0.122 |       0.006 |         0.0 | 1.045918 | 1.062924 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.984 |    0.0 | 0.540265 |        0.93 |       0.546 |       0.118 |       0.006 |         0.0 | 1.048908 | 1.065963 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0  | 0.984 |    0.0 | 0.557763 |       0.934 |        0.54 |       0.124 |       0.008 |         0.0 |  1.04989 | 1.066962 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0    | 0.984 |    0.0 | 0.560406 |       0.936 |       0.546 |       0.122 |       0.006 |         0.0 | 1.053128 | 1.070252 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.984 |    0.0 |  0.52698 |        0.93 |        0.56 |        0.12 |       0.008 |         0.0 | 1.056125 | 1.073298 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0  | 0.984 |    0.0 | 0.549725 |       0.932 |       0.554 |       0.132 |       0.008 |         0.0 | 1.056479 | 1.073658 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.984 |    0.0 | 0.574724 |       0.938 |       0.548 |       0.126 |       0.008 |         0.0 | 1.057645 | 1.074842 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.984 |    0.0 | 0.510383 |        0.93 |        0.56 |       0.124 |       0.008 |         0.0 | 1.057918 |  1.07512 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_proxy_0    | 0.984 |    0.0 | 0.523448 |        0.93 |       0.566 |       0.126 |       0.008 |         0.0 | 1.058213 |  1.07542 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.984 |    0.0 | 0.509397 |        0.93 |       0.556 |       0.126 |       0.008 |         0.0 |  1.05822 | 1.075427 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0   | 0.984 |    0.0 | 0.584889 |       0.936 |       0.546 |       0.132 |        0.01 |         0.0 | 1.058733 | 1.075948 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.984 |    0.0 | 0.513918 |        0.93 |       0.556 |       0.128 |       0.008 |         0.0 | 1.059383 | 1.076608 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_proxy_0    | 0.984 |    0.0 | 0.513043 |        0.93 |       0.564 |       0.126 |       0.008 |         0.0 | 1.059845 | 1.077078 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0  | 0.984 |    0.0 | 0.556554 |       0.934 |       0.562 |       0.126 |       0.006 |         0.0 |  1.06036 | 1.077602 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0     | 0.984 |    0.0 | 0.574844 |       0.936 |       0.546 |       0.128 |       0.006 |         0.0 | 1.060476 | 1.077719 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0 | 0.984 |    0.0 | 0.525369 |        0.93 |       0.576 |       0.128 |       0.008 |         0.0 | 1.060669 | 1.077915 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0  | 0.984 |    0.0 | 0.516634 |       0.932 |       0.566 |        0.12 |       0.008 |         0.0 | 1.060725 | 1.077973 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_proxy_0   | 0.984 |    0.0 |  0.52312 |        0.93 |       0.568 |       0.122 |       0.006 |         0.0 | 1.060757 | 1.078005 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.4_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_proxy_0    | 0.984 |    0.0 | 0.519478 |        0.93 |        0.57 |       0.124 |       0.008 |         0.0 |    1.061 | 1.078252 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_proxy_0   | 0.984 |    0.0 | 0.562379 |       0.936 |       0.562 |       0.132 |       0.008 |         0.0 | 1.061022 | 1.078274 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.984 |    0.0 | 0.509284 |        0.93 |       0.562 |        0.13 |       0.008 |         0.0 | 1.061079 | 1.078332 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0     | 0.984 |    0.0 | 0.508621 |       0.932 |        0.56 |       0.132 |       0.008 |         0.0 | 1.061497 | 1.078757 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.984 |    0.0 | 0.508798 |        0.93 |       0.562 |        0.13 |       0.008 |         0.0 | 1.061582 | 1.078843 |
| mnist_l2_plain_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0 | 0.984 |    0.0 |  0.57052 |       0.934 |       0.558 |       0.136 |       0.008 |         0.0 | 1.061751 | 1.079015 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0    | 0.984 |    0.0 | 0.519118 |        0.93 |       0.574 |       0.122 |       0.008 |         0.0 | 1.061924 | 1.079191 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0     | 0.984 |    0.0 | 0.521785 |        0.93 |       0.578 |       0.124 |       0.008 |         0.0 | 1.062024 | 1.079293 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.984 |    0.0 | 0.512093 |        0.93 |       0.562 |        0.13 |       0.008 |         0.0 | 1.062202 | 1.079473 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.984 |    0.0 | 0.510407 |        0.93 |       0.568 |       0.134 |       0.008 |         0.0 | 1.062371 | 1.079646 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0     | 0.984 |    0.0 | 0.522714 |       0.932 |        0.57 |       0.128 |       0.008 |         0.0 | 1.062459 | 1.079735 |
| mnist_l2_plain_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.984 |    0.0 | 0.521739 |        0.93 |        0.57 |       0.128 |       0.008 |         0.0 | 1.062718 | 1.079998 |
|------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|

** Linf
#+BEGIN_SRC python :noweb yes :var norm="l2" :var type="linf" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(1.0, 3.0, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| name                                                                                            |   acc | acc_l2 |  conf_l2 | acc_l2_1.00 | acc_l2_1.50 | acc_l2_2.00 | acc_l2_2.50 | acc_l2_3.00 |       l2 |  l2_corr |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.984 |    0.0 | 0.501697 |       0.782 |       0.362 |        0.07 |       0.008 |       0.004 | 1.322911 | 1.344421 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.984 |    0.0 | 0.504148 |       0.776 |       0.362 |       0.072 |        0.01 |         0.0 | 1.326564 | 1.348134 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0    | 0.984 |    0.0 |  0.50945 |       0.774 |       0.362 |        0.07 |        0.01 |         0.0 | 1.329683 | 1.351304 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.984 |    0.0 | 0.503061 |       0.774 |        0.36 |       0.072 |        0.01 |         0.0 | 1.330968 |  1.35261 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0    | 0.984 |    0.0 | 0.502361 |       0.774 |       0.342 |       0.084 |       0.016 |       0.002 | 1.331969 | 1.353627 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.984 |    0.0 | 0.515384 |       0.782 |       0.362 |        0.07 |       0.004 |         0.0 | 1.332567 | 1.354235 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.984 |    0.0 | 0.514267 |       0.776 |       0.372 |       0.068 |       0.008 |       0.004 | 1.335379 | 1.357093 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.984 |    0.0 |   0.5014 |       0.776 |        0.38 |       0.078 |       0.012 |       0.002 | 1.336799 | 1.358536 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.984 |    0.0 | 0.509618 |        0.78 |       0.364 |       0.074 |       0.008 |       0.002 | 1.337566 | 1.359315 |
| mnist_l2_linf_100_0k_adam_cw_gnorm_lr0.5_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.984 |    0.0 | 0.504489 |       0.774 |       0.372 |        0.08 |       0.012 |       0.002 | 1.337802 | 1.359555 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0 | 0.984 |    0.0 | 0.505693 |       0.774 |       0.374 |       0.076 |       0.012 |       0.002 | 1.338585 | 1.360351 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.984 |    0.0 | 0.513669 |       0.792 |       0.378 |       0.066 |       0.004 |         0.0 | 1.339504 | 1.361284 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.05_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.984 |    0.0 | 0.514845 |        0.79 |       0.378 |       0.072 |       0.006 |         0.0 | 1.340036 | 1.361825 |
| mnist_l2_linf_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0       | 0.984 |    0.0 | 0.501211 |        0.78 |       0.384 |       0.066 |       0.008 |       0.002 | 1.340058 | 1.361847 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0     | 0.984 |    0.0 | 0.509574 |       0.772 |        0.37 |       0.072 |        0.01 |         0.0 | 1.340543 | 1.362341 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.984 |    0.0 | 0.496447 |       0.772 |       0.376 |       0.084 |       0.012 |       0.004 | 1.340656 | 1.362455 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.984 |    0.0 | 0.511625 |       0.794 |       0.364 |        0.08 |       0.004 |         0.0 | 1.340877 |  1.36268 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0     | 0.984 |    0.0 | 0.517048 |       0.798 |       0.362 |        0.07 |       0.008 |         0.0 | 1.340932 | 1.362736 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.984 |    0.0 | 0.519626 |       0.786 |       0.378 |        0.08 |       0.014 |         0.0 | 1.341604 | 1.363419 |
| mnist_l2_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.05_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.984 |    0.0 | 0.503288 |       0.772 |       0.376 |       0.088 |        0.01 |       0.002 | 1.341818 | 1.363637 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.1_uniform_R0.5_decay_finetune_noproxy_0     | 0.984 |    0.0 |  0.50307 |       0.782 |       0.384 |       0.076 |       0.014 |       0.004 | 1.341853 | 1.363672 |
| mnist_l2_linf_100_0k_apg_cw_gnorm_lr0.5_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.984 |    0.0 | 0.500384 |       0.786 |       0.386 |       0.078 |       0.006 |       0.004 | 1.342006 | 1.363828 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0      | 0.984 |    0.0 | 0.511618 |       0.788 |        0.38 |        0.07 |       0.012 |       0.002 | 1.342326 | 1.364152 |
| mnist_l2_linf_100_0k_apg_cw_gnorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0      | 0.984 |    0.0 | 0.499638 |        0.77 |       0.384 |       0.068 |       0.012 |       0.004 | 1.342718 | 1.364551 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_proxy_0     | 0.984 |    0.0 | 0.512109 |        0.79 |       0.366 |       0.068 |       0.004 |       0.002 | 1.342988 | 1.364825 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_proxy_0    | 0.984 |    0.0 | 0.504043 |       0.778 |       0.378 |       0.078 |       0.016 |       0.004 | 1.343517 | 1.365363 |
| mnist_l2_linf_100_0k_apg_cw_gnorm_lr0.45_llr0.1_C0.1_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.984 |    0.0 | 0.499788 |        0.78 |        0.39 |       0.064 |       0.008 |       0.004 |  1.34361 | 1.365457 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.2_llr0.1_C0.1_uniform_R0.5_decay_finetune_proxy_0       | 0.984 |    0.0 | 0.519275 |       0.778 |       0.386 |       0.072 |       0.008 |       0.002 | 1.344878 | 1.366745 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.1_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.984 |    0.0 | 0.525546 |       0.782 |       0.378 |       0.074 |        0.01 |         0.0 | 1.345529 | 1.367408 |
| mnist_l2_linf_100_0k_apg_cw_nognorm_lr0.05_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.984 |    0.0 | 0.503809 |       0.774 |        0.38 |       0.086 |       0.012 |       0.004 | 1.345546 | 1.367424 |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|

** L2
#+BEGIN_SRC python :noweb yes :var norm="l2" :var type="l2" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(1.0, 3.0, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| name                                                                                          |   acc | acc_l2 |  conf_l2 | acc_l2_1.00 | acc_l2_1.50 | acc_l2_2.00 | acc_l2_2.50 | acc_l2_3.00 |       l2 |  l2_corr |
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.986 |    0.0 |  0.49653 |        0.93 |        0.85 |       0.714 |        0.46 |       0.146 | 2.309716 | 2.342512 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.986 |    0.0 | 0.496369 |       0.928 |       0.848 |       0.718 |       0.456 |       0.152 | 2.310151 | 2.342952 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.986 |    0.0 | 0.496669 |        0.93 |       0.848 |       0.716 |       0.458 |       0.146 | 2.310737 | 2.343546 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.986 |    0.0 | 0.497372 |        0.93 |       0.848 |       0.714 |       0.462 |       0.152 | 2.310756 | 2.343566 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0     | 0.986 |    0.0 | 0.497009 |       0.928 |       0.846 |       0.714 |       0.462 |       0.148 | 2.310988 | 2.343801 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.986 |    0.0 | 0.495363 |       0.928 |       0.846 |       0.712 |       0.456 |       0.148 | 2.311084 | 2.343898 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.986 |    0.0 | 0.496311 |        0.93 |        0.85 |       0.716 |       0.458 |       0.148 | 2.311146 | 2.343962 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.986 |    0.0 | 0.496911 |       0.932 |       0.848 |        0.72 |       0.462 |        0.15 | 2.311378 | 2.344197 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.986 |    0.0 | 0.495562 |        0.93 |       0.852 |       0.716 |       0.452 |       0.148 |  2.31206 | 2.344889 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.986 |    0.0 | 0.494695 |       0.932 |       0.852 |       0.714 |       0.458 |       0.144 | 2.312159 | 2.344989 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.986 |    0.0 | 0.496023 |        0.93 |       0.848 |       0.716 |       0.452 |        0.15 | 2.312483 | 2.345317 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.986 |    0.0 | 0.494764 |        0.93 |       0.852 |       0.714 |       0.464 |       0.148 |  2.31307 | 2.345913 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.986 |    0.0 | 0.496574 |       0.928 |       0.848 |       0.714 |       0.464 |        0.15 | 2.314062 | 2.346918 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.986 |    0.0 |  0.49637 |        0.93 |       0.848 |       0.716 |       0.458 |       0.148 | 2.314092 | 2.346949 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.986 |    0.0 | 0.500401 |       0.932 |       0.852 |       0.714 |       0.462 |       0.152 | 2.314996 | 2.347866 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.986 |    0.0 | 0.494378 |       0.928 |        0.85 |       0.714 |       0.458 |       0.158 | 2.315161 | 2.348033 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_proxy_0     | 0.986 |    0.0 | 0.499114 |       0.928 |       0.846 |       0.712 |       0.458 |        0.15 | 2.315485 | 2.348362 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_proxy_0    | 0.986 |    0.0 | 0.500727 |       0.928 |        0.85 |        0.72 |       0.454 |       0.152 | 2.315523 | 2.348401 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.05_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.986 |    0.0 |  0.49494 |        0.93 |        0.85 |       0.718 |       0.456 |       0.154 | 2.315641 | 2.348521 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_proxy_0    | 0.986 |    0.0 | 0.496821 |        0.93 |       0.852 |       0.714 |        0.46 |       0.152 | 2.315915 | 2.348798 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_proxy_0   | 0.986 |    0.0 | 0.501074 |        0.93 |        0.85 |       0.718 |       0.464 |       0.152 | 2.316223 |  2.34911 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0     | 0.986 |    0.0 | 0.494948 |        0.93 |       0.848 |       0.718 |        0.46 |       0.156 | 2.316569 | 2.349462 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.45_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.986 |    0.0 | 0.499379 |       0.928 |        0.85 |       0.722 |       0.464 |       0.152 | 2.316629 | 2.349522 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.986 |    0.0 |  0.49497 |        0.93 |        0.85 |       0.716 |       0.462 |       0.162 | 2.316758 | 2.349653 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.986 |    0.0 | 0.497315 |        0.93 |       0.852 |       0.714 |       0.466 |       0.156 | 2.316813 | 2.349709 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_proxy_0    | 0.986 |    0.0 | 0.500554 |        0.93 |       0.848 |       0.716 |       0.466 |       0.152 | 2.317153 | 2.350054 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.986 |    0.0 | 0.500112 |        0.93 |        0.85 |       0.716 |       0.462 |       0.146 | 2.317356 |  2.35026 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.986 |    0.0 | 0.501834 |        0.93 |        0.85 |       0.716 |       0.472 |       0.154 | 2.317622 | 2.350529 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.4_llr0.05_C0.5_uniform_R0.5_decay_nofinetune_proxy_0    | 0.986 |    0.0 | 0.498582 |        0.93 |        0.85 |       0.716 |        0.46 |        0.15 | 2.317757 | 2.350666 |
| mnist_l2_l2_100_0k_apg_cw_nognorm_lr0.3_llr0.05_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.986 |    0.0 | 0.494827 |        0.93 |        0.85 |       0.718 |        0.46 |       0.162 | 2.317924 | 2.350836 |
|-----------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|

* Linf
** Plain
#+BEGIN_SRC python :noweb yes :var norm="li" :var type="plain" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(0.03, 0.11, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|--------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| name                                                                                             |   acc | acc_li |  conf_li | acc_li_0.03 | acc_li_0.05 | acc_li_0.07 | acc_li_0.09 | acc_li_0.11 |       li |  li_corr |
|--------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.549292 |       0.924 |       0.791 |       0.494 |       0.196 |       0.045 |  0.06892 | 0.069828 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.550316 |       0.928 |       0.796 |       0.496 |       0.197 |       0.042 |  0.06894 | 0.069848 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.548747 |       0.924 |       0.794 |       0.496 |       0.196 |       0.044 |  0.06894 | 0.069848 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.554628 |       0.926 |       0.801 |       0.492 |       0.201 |       0.045 | 0.068945 | 0.069853 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.556079 |       0.927 |         0.8 |       0.494 |       0.201 |       0.042 |    0.069 | 0.069909 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.544442 |       0.925 |       0.801 |       0.494 |         0.2 |       0.043 |    0.069 | 0.069909 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.540799 |       0.926 |         0.8 |       0.497 |       0.204 |       0.043 | 0.069026 | 0.069935 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.552299 |       0.925 |         0.8 |       0.494 |       0.199 |       0.042 | 0.069032 | 0.069941 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.545364 |       0.925 |       0.799 |       0.497 |       0.198 |       0.045 | 0.069051 | 0.069961 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.543111 |       0.926 |       0.798 |       0.502 |       0.199 |       0.044 | 0.069125 | 0.070036 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.538691 |       0.926 |       0.803 |       0.499 |       0.206 |       0.044 | 0.069185 | 0.070097 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 |  0.54965 |       0.926 |         0.8 |       0.494 |       0.205 |       0.046 |  0.06922 | 0.070132 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.552424 |       0.928 |       0.804 |       0.495 |       0.201 |       0.045 | 0.069237 | 0.070149 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 |  0.55388 |       0.928 |       0.806 |       0.499 |       0.205 |       0.044 | 0.069241 | 0.070153 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.553285 |       0.928 |       0.806 |       0.494 |       0.205 |       0.045 | 0.069255 | 0.070167 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.542236 |       0.926 |       0.801 |       0.501 |       0.206 |       0.045 | 0.069257 | 0.070169 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.548983 |       0.927 |       0.803 |       0.498 |       0.205 |       0.044 | 0.069276 | 0.070188 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.538924 |       0.926 |       0.802 |         0.5 |       0.212 |       0.045 | 0.069277 | 0.070189 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.550233 |       0.927 |       0.805 |       0.499 |       0.204 |       0.045 | 0.069281 | 0.070194 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.558921 |       0.926 |       0.799 |       0.499 |         0.2 |       0.048 | 0.069288 | 0.070201 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.546788 |       0.926 |       0.806 |       0.496 |       0.199 |       0.049 | 0.069344 | 0.070258 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.546239 |       0.927 |       0.804 |       0.502 |       0.202 |       0.046 | 0.069355 | 0.070268 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.544762 |       0.926 |       0.804 |       0.505 |       0.202 |       0.049 | 0.069372 | 0.070286 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.5_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.559375 |       0.926 |       0.802 |       0.501 |       0.202 |       0.044 | 0.069373 | 0.070287 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.541164 |       0.926 |       0.804 |       0.499 |       0.207 |       0.047 | 0.069436 |  0.07035 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.537626 |       0.926 |       0.802 |       0.502 |       0.206 |       0.045 | 0.069472 | 0.070387 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.547323 |       0.926 |       0.804 |       0.501 |       0.211 |       0.045 | 0.069484 |   0.0704 |
| mnist_li_plain_100_0k_apg_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.543716 |       0.926 |       0.799 |         0.5 |       0.204 |       0.052 | 0.069522 | 0.070438 |
| mnist_li_plain_100_0k_adam_cw_gnorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.543238 |       0.926 |         0.8 |       0.505 |        0.21 |       0.048 | 0.069527 | 0.070443 |
| mnist_li_plain_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.538069 |       0.926 |       0.806 |       0.506 |       0.212 |       0.049 |  0.06956 | 0.070476 |
|--------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|

** Linf
#+BEGIN_SRC python :noweb yes :var norm="li" :var type="linf" :results value :return df_org
  <<init_block>>
  thresholds = [0.2, 0.25, 0.3, 0.325, 0.35]
  <<output_results>>
#+END_SRC

#+RESULTS:
|--------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| name                                                                                             |   acc | acc_li |  conf_li | acc_li_0.20 | acc_li_0.25 | acc_li_0.30 | acc_li_0.33 | acc_li_0.35 |       li |  li_corr |
|--------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| mnist_li_linf_100_0k_apg_cw_gnorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_proxy_0       |   1.0 |    0.0 |      0.0 |         0.0 |         0.0 |         0.0 |         0.0 |         0.0 |      0.0 |      0.0 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.555772 |       0.947 |       0.932 |       0.908 |       0.753 |        0.34 | 0.327051 | 0.332032 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 |  0.53612 |       0.949 |       0.931 |       0.907 |        0.75 |       0.337 | 0.327089 |  0.33207 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.520214 |       0.949 |       0.931 |       0.912 |       0.758 |       0.341 | 0.327147 | 0.332129 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.3_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.550297 |       0.948 |       0.936 |       0.909 |        0.76 |       0.336 | 0.327164 | 0.332146 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0   | 0.985 |    0.0 | 0.545955 |       0.949 |        0.93 |       0.909 |       0.754 |       0.344 | 0.327215 | 0.332198 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.985 |    0.0 | 0.550362 |       0.943 |       0.932 |       0.911 |       0.752 |       0.347 | 0.327235 | 0.332218 |
| mnist_li_linf_100_0k_apg_cw_gnormsign_lr0.15_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0 | 0.985 |    0.0 | 0.548289 |       0.947 |        0.93 |       0.907 |       0.766 |       0.308 | 0.327315 |   0.3323 |
| mnist_li_linf_100_0k_apg_cw_gnormsign_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.985 |    0.0 | 0.533927 |        0.95 |        0.93 |       0.906 |        0.76 |       0.349 |  0.32734 | 0.332325 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.15_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.531634 |        0.95 |       0.931 |       0.909 |       0.759 |        0.35 | 0.327368 | 0.332354 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.35_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.550346 |        0.95 |       0.938 |        0.91 |       0.759 |        0.34 | 0.327371 | 0.332356 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.5_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.559871 |       0.952 |       0.933 |       0.906 |       0.765 |       0.334 | 0.327385 |  0.33237 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.985 |    0.0 | 0.530031 |       0.948 |       0.932 |       0.907 |       0.752 |       0.352 |  0.32742 | 0.332406 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.25_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.546573 |       0.948 |       0.934 |       0.908 |        0.76 |       0.348 | 0.327425 | 0.332411 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0       | 0.985 |    0.0 | 0.525544 |       0.949 |       0.934 |       0.913 |       0.747 |       0.334 | 0.327436 | 0.332423 |
| mnist_li_linf_100_0k_apg_cw_gnormsign_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.985 |    0.0 | 0.543986 |       0.946 |       0.933 |       0.904 |       0.777 |       0.344 | 0.327439 | 0.332425 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.1_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 | 0.519625 |        0.95 |       0.936 |       0.906 |       0.762 |       0.358 | 0.327468 | 0.332455 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.2_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0     | 0.985 |    0.0 |  0.54044 |       0.951 |       0.936 |        0.91 |       0.753 |       0.341 | 0.327488 | 0.332475 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.985 |    0.0 |  0.51574 |       0.949 |       0.934 |       0.906 |       0.763 |        0.34 | 0.327574 | 0.332563 |
| mnist_li_linf_100_0k_apg_cw_gnormsign_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.985 |    0.0 | 0.560459 |       0.945 |       0.932 |       0.903 |        0.79 |       0.347 | 0.327625 | 0.332614 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.985 |    0.0 |   0.5223 |       0.951 |       0.933 |       0.909 |        0.77 |       0.352 | 0.327655 | 0.332645 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0    | 0.985 |    0.0 | 0.558239 |       0.949 |       0.935 |       0.912 |        0.76 |       0.355 | 0.327672 | 0.332661 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_nodecay_finetune_noproxy_0  | 0.985 |    0.0 | 0.546461 |       0.947 |       0.929 |       0.905 |       0.765 |       0.358 | 0.327691 | 0.332681 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0       | 0.985 |    0.0 | 0.518396 |        0.95 |       0.934 |       0.911 |       0.765 |       0.352 | 0.327712 | 0.332703 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0     | 0.985 |    0.0 |  0.52745 |       0.951 |       0.934 |       0.912 |        0.75 |       0.346 | 0.327764 | 0.332755 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.45_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0  | 0.985 |    0.0 | 0.560031 |       0.948 |       0.935 |       0.908 |       0.763 |       0.356 | 0.327777 | 0.332769 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.985 |    0.0 | 0.531105 |        0.95 |       0.936 |        0.91 |       0.758 |       0.344 | 0.327874 | 0.332867 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.4_llr0.1_C0.5_uniform_R0.5_nodecay_nofinetune_noproxy_0   | 0.985 |    0.0 | 0.563407 |        0.95 |       0.933 |       0.909 |       0.755 |       0.352 | 0.327891 | 0.332884 |
| mnist_li_linf_100_0k_adam_cw_gnorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.985 |    0.0 | 0.509788 |        0.95 |       0.933 |       0.909 |       0.761 |       0.361 | 0.327913 | 0.332907 |
| mnist_li_linf_100_0k_adam_cw_nognorm_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.985 |    0.0 | 0.511925 |       0.952 |       0.936 |       0.907 |        0.76 |       0.349 | 0.327955 | 0.332949 |
|--------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|

** L2
#+BEGIN_SRC python :noweb yes :var norm="li" :var type="l2" :results value :return df_org
  <<init_block>>
  thresholds = np.linspace(0.05, 0.25, 5)
  <<output_results>>
#+END_SRC

#+RESULTS:
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| name                                                                                            |   acc | acc_li |  conf_li | acc_li_0.05 | acc_li_0.10 | acc_li_0.15 | acc_li_0.20 | acc_li_0.25 |       li |  li_corr |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.488034 |       0.964 |       0.909 |       0.742 |       0.328 |       0.022 | 0.173488 | 0.175774 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.491734 |       0.966 |       0.912 |       0.745 |       0.323 |       0.023 | 0.173664 | 0.175952 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.494649 |       0.966 |       0.913 |       0.747 |       0.334 |       0.021 | 0.174156 |  0.17645 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.483451 |       0.965 |       0.909 |       0.744 |       0.342 |       0.026 | 0.174176 |  0.17647 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.498938 |       0.968 |       0.918 |       0.753 |       0.342 |       0.021 | 0.174833 | 0.177136 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.987 |    0.0 | 0.494372 |       0.964 |       0.912 |       0.748 |       0.354 |       0.028 | 0.175092 | 0.177398 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.987 |    0.0 | 0.498147 |       0.968 |       0.918 |       0.749 |       0.356 |       0.026 |  0.17528 | 0.177589 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.495127 |       0.964 |       0.912 |       0.755 |       0.363 |       0.022 | 0.175407 | 0.177717 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0      | 0.987 |    0.0 | 0.489247 |       0.965 |       0.911 |       0.749 |       0.365 |       0.027 | 0.175411 | 0.177722 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.491647 |       0.964 |       0.912 |       0.758 |       0.355 |       0.024 | 0.175439 |  0.17775 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.497739 |       0.964 |       0.913 |       0.756 |       0.361 |       0.022 |  0.17546 | 0.177771 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.493039 |       0.964 |        0.91 |       0.755 |       0.357 |       0.023 | 0.175476 | 0.177787 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.501803 |       0.966 |       0.914 |       0.747 |       0.366 |       0.026 | 0.175501 | 0.177812 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.490281 |       0.965 |        0.91 |       0.755 |       0.361 |       0.026 | 0.175506 | 0.177818 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.1_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0   | 0.987 |    0.0 | 0.492723 |       0.965 |       0.909 |       0.749 |       0.358 |       0.027 | 0.175529 | 0.177841 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.502931 |       0.969 |       0.917 |       0.753 |        0.35 |        0.02 |  0.17553 | 0.177841 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 | 0.498141 |       0.964 |       0.913 |       0.756 |       0.361 |       0.022 | 0.175584 | 0.177897 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.15_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 |  0.49045 |       0.965 |        0.91 |       0.755 |       0.363 |       0.026 | 0.175607 |  0.17792 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 |  0.49524 |       0.965 |       0.911 |        0.76 |       0.362 |       0.022 | 0.175614 | 0.177927 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 |  0.50007 |       0.964 |       0.912 |       0.757 |       0.363 |        0.02 | 0.175737 | 0.178052 |
| mnist_li_l2_100_0k_apg_cw_gnormsign_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_proxy_0       | 0.987 |    0.0 | 0.502027 |       0.968 |        0.92 |       0.752 |       0.356 |       0.023 | 0.175788 | 0.178104 |
| mnist_li_l2_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 |  0.49141 |       0.964 |       0.913 |       0.756 |        0.36 |       0.023 | 0.175847 | 0.178163 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0    | 0.987 |    0.0 | 0.501782 |       0.964 |       0.914 |        0.76 |       0.366 |       0.019 | 0.175857 | 0.178173 |
| mnist_li_l2_100_0k_adam_cw_nognorm_lr0.25_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0     | 0.987 |    0.0 | 0.494634 |       0.964 |       0.912 |        0.76 |       0.359 |       0.022 | 0.175886 | 0.178202 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.35_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0 | 0.987 |    0.0 | 0.500889 |       0.964 |       0.912 |       0.757 |       0.365 |       0.021 | 0.175926 | 0.178243 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.4_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0  | 0.987 |    0.0 |  0.50193 |       0.964 |       0.914 |       0.759 |       0.367 |       0.019 | 0.175976 | 0.178294 |
| mnist_li_l2_100_0k_adam_cw_gnorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0        | 0.987 |    0.0 | 0.497653 |       0.964 |       0.911 |        0.76 |       0.369 |       0.024 | 0.176007 | 0.178326 |
| mnist_li_l2_100_0k_adam_cw_nognorm_lr0.2_llr0.1_C0.5_uniform_R0.5_decay_nofinetune_noproxy_0    | 0.987 |    0.0 | 0.492336 |       0.965 |       0.912 |       0.757 |       0.358 |       0.025 | 0.176011 | 0.178329 |
| mnist_li_l2_100_0k_adam_cw_nognorm_lr0.3_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0      | 0.987 |    0.0 | 0.497999 |       0.964 |       0.911 |       0.758 |       0.363 |       0.023 | 0.176036 | 0.178355 |
| mnist_li_l2_100_0k_adam_cw_gnormsign_lr0.45_llr0.1_C0.5_uniform_R0.5_decay_finetune_noproxy_0   | 0.987 |    0.0 | 0.504514 |       0.965 |       0.912 |       0.756 |       0.374 |        0.02 |  0.17609 |  0.17841 |
|-------------------------------------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+-------------+----------+----------|

* COMMENT Local Variables
# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
